RT-Thread-Studio/sdk-csp-gd32h7/libraries/GD32H75E_standard_peripheral/Source/gd32h75e_spi.c
}

/*!
    \brief      configure SPI bidirectional transfer direction
    \param[in]  spi_periph: SPIx(x=0,1,2,3,4,5)
    \param[in]  transfer_direction: SPI transfer direction
                only one parameter can be selected which is shown as below:
      \arg        SPI_BIDIRECTIONAL_TRANSMIT: SPI work in transmit-only mode
      \arg        SPI_BIDIRECTIONAL_RECEIVE: SPI work in receive-only mode
    \retval     none
*/
void spi_bidirectional_transfer_config(uint32_t spi_periph, uint32_t transfer_direction)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x001CU), ERR_PERIPH);
    } else if(NOT_SPI_TRANS_DIR(transfer_direction)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x001CU), ERR_PARAM_INVALID);
    } else
#endif
    {
        if(SPI_BIDIRECTIONAL_TRANSMIT == transfer_direction) {
            /* set the transmit only mode */
            SPI_CFG1(spi_periph) |= (uint32_t)SPI_BIDIRECTIONAL_TRANSMIT;
        } else {
            /* set the receive only mode */
            SPI_CFG1(spi_periph) &= SPI_BIDIRECTIONAL_RECEIVE;
        }
    }
}

/*!
    \brief      SPI/I2S master start transfer
    \param[in]  spi_periph: SPIx(x=0,1,2,3,4,5)
    \param[in]  transfer_start: transfer start bit
                only one parameter can be selected which is shown as below:
      \arg        SPI_TRANS_START: the master transmission is occurring,
                                   or has been temporarily suspended by automatic suspend
      \arg        SPI_TRANS_IDLE: the master transfer is idle status
    \retval     none
*/
void spi_master_transfer_start(uint32_t spi_periph, uint32_t transfer_start)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x001DU), ERR_PERIPH);
    } else if(NOT_SPI_START_TRANS_MODE(transfer_start)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x001DU), ERR_PARAM_INVALID);
    } else
#endif
    {
        if(SPI_TRANS_START == transfer_start) {
            SPI_CTL0(spi_periph) |= (uint32_t)SPI_CTL0_MSTART;
        } else {
            SPI_CTL0(spi_periph) &= (uint32_t)(~SPI_CTL0_MSTART);
        }
    }
}

/*!
    \brief     configure SPI current data number
    \param[in]  spi_periph: SPIx(x=0,1,2,3,4,5)
    \param[in]  current_num: SPI transfer current data number
                             it can be 0-0xFFFF
    \retval     none
*/
void spi_current_data_num_config(uint32_t spi_periph, uint32_t current_num)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x001EU), ERR_PERIPH);
    } else if(NOT_SPI_TRANS_NUM(current_num)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x001EU), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif
    {
        uint32_t reg = SPI_CTL1(spi_periph);
        /* confige SPI current data number */
        reg &= (uint32_t)(~BITS(0, 15));
        reg |= (uint32_t)current_num;
        SPI_CTL1(spi_periph) = reg;
    }
}

/*!
    \brief      configure SPI reload data number
    \param[in]  spi_periph: SPIx(x=0,1,2,3,4,5)
    \param[in]  reload_num: SPI transfer reload data number
                             it can be 0-0xFFFF
    \retval     none
*/
void spi_reload_data_num_config(uint32_t spi_periph, uint32_t reload_num)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x001FU), ERR_PERIPH);
    } else if(NOT_SPI_RELOAD_NUM(reload_num)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x001FU), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif
    {
        uint32_t reg = SPI_CTL1(spi_periph);
        /* confige SPI reload data number */
        reg &= (uint32_t)(~BITS(16, 31));
        reg |= (uint32_t)(reload_num << 16U);
        SPI_CTL1(spi_periph) = reg;
    }
}

/*!
    \brief      set SPI CRC polynomial
    \param[in]  spi_periph: SPIx(x=0,1,2,3,4,5)
    \param[in]  crc_poly: CRC polynomial value
    \param[out] none
    \retval     none
*/
void spi_crc_polynomial_set(uint32_t spi_periph, uint32_t crc_poly)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0020U), ERR_PERIPH);
    } else
#endif
    {
        /* enable SPI CRC */
        SPI_CFG0(spi_periph) |= (uint32_t)SPI_CFG0_CRCEN;
        /* set SPI CRC polynomial */
        SPI_CRCPOLY(spi_periph) = (uint32_t)crc_poly;
    }
}

/*!
    \brief      get SPI CRC polynomial
    \param[in]  spi_periph: SPIx(x=0,1,2,3,4,5)
    \param[out] none
    \retval     32-bit CRC polynomial
*/
uint32_t spi_crc_polynomial_get(uint32_t spi_periph)
{
    uint32_t reval = 0U ;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0021U), ERR_PERIPH);
    } else
#endif
    {
        reval = ((uint32_t)SPI_CRCPOLY(spi_periph));
    }
    return reval;
}

/*!
    \brief      configure SPI CRC length
    \param[in]  spi_periph: (x=0,1,2,3,4,5)
    \param[in]  crc_size: SPI_CRCSIZE_4BIT, SPI_CRCSIZE_5BIT, SPI_CRCSIZE_6BIT,
                          SPI_CRCSIZE_7BIT, SPI_CRCSIZE_8BIT, SPI_CRCSIZE_9BIT, SPI_CRCSIZE_10BIT,
                          SPI_CRCSIZE_11BIT, SPI_CRCSIZE_12BIT, SPI_CRCSIZE_13BIT, SPI_CRCSIZE_14BIT,
                          SPI_CRCSIZE_15BIT, SPI_CRCSIZE_16BIT, SPI_CRCSIZE_17BIT, SPI_CRCSIZE_18BIT,
                          SPI_CRCSIZE_19BIT, SPI_CRCSIZE_20BIT, SPI_CRCSIZE_21BIT, SPI_CRCSIZE_22BIT,
                          SPI_CRCSIZE_23BIT, SPI_CRCSIZE_24BIT, SPI_CRCSIZE_25BIT, SPI_CRCSIZE_26BIT,
                          SPI_CRCSIZE_27BIT, SPI_CRCSIZE_28BIT, SPI_CRCSIZE_29BIT, SPI_CRCSIZE_30BIT,
                          SPI_CRCSIZE_31BIT, SPI_CRCSIZE_32BIT
    \param[out] none
    \retval     none
*/
void spi_crc_length_config(uint32_t spi_periph, uint32_t crc_size)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0022U), ERR_PERIPH);
    } else if(NOT_SPI_CRC_LENGTH(crc_size)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0022U), ERR_PARAM_INVALID);
    } else
#endif
    {
        uint32_t reg = SPI_CFG0(spi_periph);
        /* confige SPI_CFG0_CRCSZ bits */
        reg &= (uint32_t)(~SPI_CFG0_CRCSZ);
        reg |= (uint32_t)crc_size;
        SPI_CFG0(spi_periph) = reg;
    }
}

/*!
    \brief      turn on CRC function
    \param[in]  spi_periph: SPIx(x=0,1,2,3,4,5)
    \param[out] none
    \retval     none
*/
void spi_crc_on(uint32_t spi_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0023U), ERR_PERIPH);
    } else
#endif
    {
        SPI_CFG0(spi_periph) |= (uint32_t)SPI_CFG0_CRCEN;
    }
}

/*!
    \brief      turn off CRC function
    \param[in]  spi_periph: SPIx(x=0,1,2,3,4,5)
    \param[out] none
    \retval     none
*/
void spi_crc_off(uint32_t spi_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0024U), ERR_PERIPH);
    } else
#endif
    {
        SPI_CFG0(spi_periph) &= (uint32_t)(~SPI_CFG0_CRCEN);
    }
}

/*!
    \brief      get SPI CRC send value or receive value
    \param[in]  spi_periph: SPIx(x=0,1,2,3,4,5)
    \param[in]  crc: SPI crc value
                only one parameter can be selected which is shown as below:
      \arg        SPI_CRC_TX: get transmit crc value
      \arg        SPI_CRC_RX: get receive crc value
    \param[out] none
    \retval     32-bit CRC value
*/
uint32_t spi_crc_get(uint32_t spi_periph, uint8_t crc)
{
    uint32_t reval = 0U;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0025U), ERR_PERIPH);
    } else if(NOT_SPI_CRC_VALUE(crc)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0025U), ERR_PARAM_INVALID);
    } else
#endif
    {
        if(SPI_CRC_TX == crc) {
            reval = ((uint32_t)(SPI_TCRC(spi_periph)));
        } else {
            reval = ((uint32_t)(SPI_RCRC(spi_periph)));
        }
    }
    return reval;
}

/*!
    \brief      enable SPI CRC full size(33 bit or 17 bit) polynomial
    \param[in]  spi_periph: SPIx(x=0,1,2,3,4,5)
    \param[out] none
    \retval     none
*/
void spi_crc_full_size_enable(uint32_t spi_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0026U), ERR_PERIPH);
    } else
#endif
    {
        SPI_CTL0(spi_periph) |= (uint32_t)SPI_CTL0_CRCFS;
    }
}

/*!
    \brief      disable SPI CRC full size(33 bit or 17 bit) polynomial
    \param[in]  spi_periph: SPIx(x=0,1,2,3,4,5)
    \param[out] none
    \retval     none
*/
void spi_crc_full_size_disable(uint32_t spi_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0027U), ERR_PERIPH);
    } else
#endif
    {
        SPI_CTL0(spi_periph) &= (uint32_t)(~SPI_CTL0_CRCFS);
    }
}

/*!
    \brief      configure SPI TCRC init pattern
    \param[in]  spi_periph: SPIx(x=0,1,2,3,4,5)
    \param[in]  init_pattern: SPI crc value
                only one parameter can be selected which is shown as below:
      \arg        SPI_TCRC_INIT_1: use all 1 pattern
      \arg        SPI_TCRC_INIT_0: use all 0 pattern
    \param[out] none
    \retval     none
*/
void spi_tcrc_init_pattern(uint32_t spi_periph, uint32_t init_pattern)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0028U), ERR_PERIPH);
    } else if(NOT_SPI_TCRC_VALUE(init_pattern)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0028U), ERR_PARAM_INVALID);
    } else
#endif
    {
        if(init_pattern == SPI_TCRC_INIT_1) {
            SPI_CTL0(spi_periph) |= (uint32_t)(SPI_CTL0_TXCRCI);
        } else {
            SPI_CTL0(spi_periph) &= (uint32_t)(~SPI_CTL0_TXCRCI);
        }
    }
}

/*!
    \brief      configure SPI RCRC init pattern
    \param[in]  spi_periph: SPIx(x=0,1,2,3,4,5)
    \param[in]  init_pattern: SPI crc value
                only one parameter can be selected which is shown as below:
      \arg        SPI_RCRC_INIT_1: use all 1 pattern
      \arg        SPI_RCRC_INIT_0: use all 0 pattern
    \param[out] none
    \retval     none
*/
void spi_rcrc_init_pattern(uint32_t spi_periph, uint32_t init_pattern)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0029U), ERR_PERIPH);
    } else if(NOT_SPI_RCRC_VALUE(init_pattern)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0029U), ERR_PARAM_INVALID);
    } else
#endif
    {
        if(init_pattern == SPI_RCRC_INIT_1) {
            SPI_CTL0(spi_periph) |= (uint32_t)(SPI_CTL0_RXCRCI);
        } else {
            SPI_CTL0(spi_periph) &= (uint32_t)(~SPI_CTL0_RXCRCI);
        }
    }
}

/*!
    \brief      enable SPI TI mode
    \param[in]  spi_periph: SPIx(x=0,1,2,3,4,5)
    \param[out] none
    \retval     none
*/
void spi_ti_mode_enable(uint32_t spi_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x002AU), ERR_PERIPH);
    } else
#endif
    {
        SPI_CFG1(spi_periph) |= (uint32_t)SPI_CFG1_TMOD;
    }
}

/*!
    \brief      disable SPI TI mode
    \param[in]  spi_periph: SPIx(x=0,1,2,3,4,5)
    \param[out] none
    \retval     none
*/
void spi_ti_mode_disable(uint32_t spi_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x002BU), ERR_PERIPH);
    } else
#endif
    {
        SPI_CFG1(spi_periph) &= (uint32_t)(~SPI_CFG1_TMOD);
    }
}

/*!
    \brief      enable quad wire SPI
    \param[in]  spi_periph: SPIx(x=3,4)
    \param[out] none
    \retval     none
*/
void spi_quad_enable(uint32_t spi_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x002CU), ERR_PERIPH);
    } else
#endif
    {
        SPI_QCTL(spi_periph) |= (uint32_t)SPI_QCTL_QMOD;
    }
}

/*!
    \brief      disable quad wire SPI
    \param[in]  spi_periph: SPIx(x=3,4)
    \param[out] none
    \retval     none
*/
void spi_quad_disable(uint32_t spi_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x002DU), ERR_PERIPH);
    } else
#endif
    {
        SPI_QCTL(spi_periph) &= (uint32_t)(~SPI_QCTL_QMOD);
    }
}

/*!
    \brief      enable quad wire SPI write
    \param[in]  spi_periph: SPIx(x=3,4)
    \param[out] none
    \retval     none
*/
void spi_quad_write_enable(uint32_t spi_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x002EU), ERR_PERIPH);
    } else
#endif
    {
        SPI_QCTL(spi_periph) &= (uint32_t)(~SPI_QCTL_QRD);
    }
}

/*!
    \brief      enable quad wire SPI read
    \param[in]  spi_periph: SPIx(x=3,4)
    \param[out] none
    \retval     none
*/
void spi_quad_read_enable(uint32_t spi_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x002FU), ERR_PERIPH);
    } else
#endif
    {
        SPI_QCTL(spi_periph) |= (uint32_t)SPI_QCTL_QRD;
    }
}

/*!
    \brief      enable SPI_IO2 and SPI_IO3 pin output
    \param[in]  spi_periph: SPIx(x=3,4)
    \param[out] none
    \retval     none
*/
void spi_quad_io23_output_enable(uint32_t spi_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0030U), ERR_PERIPH);
    } else
#endif
    {
        SPI_QCTL(spi_periph) |= (uint32_t)SPI_QCTL_IO23_DRV;
    }
}

/*!
   \brief      disable SPI_IO2 and SPI_IO3 pin output
   \param[in]  spi_periph: SPIx(x=3,4)
   \param[out] none
   \retval     none
*/
void spi_quad_io23_output_disable(uint32_t spi_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0031U), ERR_PERIPH);
    } else
#endif
    {
        SPI_QCTL(spi_periph) &= (uint32_t)(~SPI_QCTL_IO23_DRV);
    }
}

/*!
    \brief      slave transmitter underrun detected operation
    \param[in]  spi_periph: SPIx(x=0,1,2,3,4,5)
    \param[in]  ur_ope: underrun operation
                only one parameter can be selected which is shown as below:
      \arg        SPI_CONFIG_REGISTER_PATTERN: slave send a constant value defined by the SPI_URDATA register
      \arg        SPI_CONFIG_LAST_RECEIVED: slave send the lastly data frame received from master
      \arg        SPI_CONFIG_LAST_TRANSMITTED: slave send its lastly transmitted data frame
    \param[out] none
    \retval     none
*/
void spi_underrun_operation(uint32_t spi_periph, uint32_t ur_ope)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0032U), ERR_PERIPH);
    } else if(NOT_SPI_UNDERRUN_OPERAT(ur_ope)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0032U), ERR_PARAM_INVALID);
    } else
#endif
    {
        /* acquire SPI_CFG0 register */
        uint32_t reg = SPI_CFG0(spi_periph);
        reg &= (uint32_t)(~SPI_CFG0_TXUROP);
        reg |= (uint32_t)ur_ope;
        /* assign regiser */
        SPI_CFG0(spi_periph) = reg;
    }
}

/*!
    \brief      configure slave transmitter underrun detected
    \param[in]  spi_periph: SPIx(x=0,1,2,3,4,5)
    \param[in]  ur_cfg: underrun config
                only one parameter can be selected which is shown as below:
      \arg        SPI_DETECT_BEGIN_DATA_FRAME: underrun detected at start of data frame (no bit 1 protection)
      \arg        SPI_DETECT_END_DATA_FRAME: underrun detected at end of last data frame
      \arg        SPI_DETECT_BEGIN_ACTIVE_NSS: underrun detected at start of NSS signal
    \param[out] none
    \retval     none
*/
void spi_underrun_config(uint32_t spi_periph, uint32_t ur_cfg)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0033U), ERR_PERIPH);
    } else if(NOT_SPI_UNDERRUN_DETECT(ur_cfg)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0033U), ERR_PARAM_INVALID);
    } else
#endif
    {
        /* acquire SPI_CFG0 register */
        uint32_t reg = SPI_CFG0(spi_periph);
        reg &= (uint32_t)(~SPI_CFG0_TXURDT);
        reg |= (uint32_t)ur_cfg;
        /* assign regiser */
        SPI_CFG0(spi_periph) = reg;
    }
}

/*!
    \brief      configure underrun data at slave mode
    \param[in]  spi_periph: SPIx(x=0,1,2,3,4,5)
    \param[in]  udata: underrun data
                       it can be 0-0xFFFFFFFF
    \param[out] none
    \retval     none
*/
void spi_underrun_data_config(uint32_t spi_periph, uint32_t udata)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0034U), ERR_PERIPH);
    } else
#endif
    {
        SPI_URDATA(spi_periph) = (uint32_t)udata;
    }
}

/*!
    \brief      configure SPI suspend in receive mode
    \param[in]  spi_periph: SPIx(x=0,1,2,3,4,5)
    \param[in]  sus_mode: suspend mode
                only one parameter can be selected which is shown as below:
      \arg        SPI_AUTO_SUSPEND: until the overrun condition is reached,
                                    the SPI stream is suspended in the full RxFIFO state
      \arg        SPI_CONTINUOUS: SPI stream/clock generation is continuous whether or not an overrun occurs
    \param[out] none
    \retval     none
*/
void spi_suspend_mode_config(uint32_t spi_periph, uint32_t sus_mode)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0035U), ERR_PERIPH);
    } else if(NOT_SPI_SUSPEND_CONFIG(sus_mode)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0035U), ERR_PARAM_INVALID);
    } else
#endif
    {
        if(SPI_AUTO_SUSPEND == sus_mode) {
            SPI_CTL0(spi_periph) |= (uint32_t)SPI_CTL0_MASP;
        } else {
            SPI_CTL0(spi_periph) &= (uint32_t)(~SPI_CTL0_MASP);
        }
    }
}

/*!
    \brief      SPI master mode suspend request
    \param[in]  spi_periph: SPIx(x=0,1,2,3,4,5)
    \param[out] none
    \retval     none
*/
void spi_suspend_request(uint32_t spi_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0036U), ERR_PERIPH);
    } else
#endif
    {
        SPI_CTL0(spi_periph) |= (uint32_t)SPI_CTL0_MSPDR;
    }
}

/*!
    \brief     enable SPI related IOs AF
    \param[in]  spi_periph: SPIx(x=0,1,2,3,4,5)
    \param[out] none
    \retval     none
*/
void spi_related_ios_af_enable(uint32_t spi_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0037U), ERR_PERIPH);
    } else
#endif
    {
        SPI_CTL0(spi_periph) &= (uint32_t)(~SPI_CTL0_IOAFEN);
    }
}

/*!
    \brief      disable SPI related IOs AF
    \param[in]  spi_periph: SPIx(x=0,1,2,3,4,5)
    \param[out] none
    \retval     none
*/
void spi_related_ios_af_disable(uint32_t spi_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0038U), ERR_PERIPH);
    } else
#endif
    {
        SPI_CTL0(spi_periph) |= (uint32_t)SPI_CTL0_IOAFEN;
    }
}

/*!
    \brief      SPI af gpio control
    \param[in]  spi_periph: SPIx(x=0,1,2,3,4,5)
    \param[in]  ctl: gpio control bit
                only one parameter can be selected which is shown as below:
      \arg        SPI_GPIO_CONTROL: SPI always control all associated GPIO
      \arg        SPI_GPIO_FREE: SPI do not control GPIO when disabled
    \param[out] none
    \retval     none
*/
void spi_af_gpio_control(uint32_t spi_periph, uint32_t ctl)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0039U), ERR_PERIPH);
    } else if(NOT_SPI_AF_CONFIG(ctl)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0039U), ERR_PARAM_INVALID);
    } else
#endif
    {
        if(SPI_GPIO_CONTROL == ctl) {
            SPI_CFG1(spi_periph) |= (uint32_t)SPI_CFG1_AFCTL;
        } else {
            SPI_CFG1(spi_periph) &= (uint32_t)(~SPI_CFG1_AFCTL);
        }
    }
}

/*!
    \brief      enable SPI and I2S interrupt
    \param[in]  spi_periph: SPIx(x=0,1,2,3,4,5)
    \param[in]  interrupt: SPI/I2S interrupt
                only one parameter can be selected which is shown as below:
      \arg        SPI_I2S_INT_RP: RP interrupt
      \arg        SPI_I2S_INT_TP: TP interrupt
      \arg        SPI_I2S_INT_DP: DP interrupt
      \arg        SPI_I2S_INT_ESTC: end of transfer or suspend or TxFIFO clear interrupt
      \arg        SPI_I2S_INT_TXF: transmission filled interrupt
      \arg        SPI_I2S_INT_TXURE: underrun error interrupt
      \arg        SPI_I2S_INT_RXORE: overrun error interrupt
      \arg        SPI_I2S_INT_CRCER: CRC error interrupt
      \arg        SPI_I2S_INT_FE: TI frame error interrupt
      \arg        SPI_I2S_INT_CONFE: mode error interrupt
      \arg        SPI_I2S_INT_TXSERF: TXSER reload interrupt
    \param[out] none
    \retval     none
*/
void spi_i2s_interrupt_enable(uint32_t spi_periph, uint8_t interrupt)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x003AU), ERR_PERIPH);
    } else if(NOT_SPI_I2S_INTERRUPT(interrupt)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x003AU), ERR_PARAM_INVALID);
    } else
#endif
    {
        switch(interrupt) {
        /* SPI/I2S RP interrupt */
        case SPI_I2S_INT_RP:
            SPI_INT(spi_periph) |= (uint32_t)SPI_INT_RPIE;
            break;
        /* SPI/I2S TP interrupt */
        case SPI_I2S_INT_TP:
            SPI_INT(spi_periph) |= (uint32_t)SPI_INT_TPIE;
            break;
        /* SPI/I2S DP interrupt */
        case SPI_I2S_INT_DP:
            SPI_INT(spi_periph) |= (uint32_t)SPI_INT_DPIE;
            break;
        /* SPI/I2S end of transfer or suspend or TXFIFO clear interrupt */
        case SPI_I2S_INT_ESTC:
            SPI_INT(spi_periph) |= (uint32_t)SPI_INT_ESTCIE;
            break;
        /* SPI/I2S transmission filled interrupt */
        case SPI_I2S_INT_TXF:
            SPI_INT(spi_periph) |= (uint32_t)SPI_INT_TXFIE;
            break;
        /* SPI/I2S underrun error interrupt */
        case SPI_I2S_INT_TXURE:
            SPI_INT(spi_periph) |= (uint32_t)SPI_INT_TXUREIE;
            break;
        /* SPI/I2S overrun error interrupt*/
        case SPI_I2S_INT_RXORE:
            SPI_INT(spi_periph) |= (uint32_t)SPI_INT_RXOREIE;
            break;
        /* SPI/I2S CRC error interrupt */
        case SPI_I2S_INT_CRCER:
            SPI_INT(spi_periph) |= (uint32_t)SPI_INT_CRCERIE;
            break;
        /* SPI TI frame error interrupt */
        case SPI_I2S_INT_FE:
            SPI_INT(spi_periph) |= (uint32_t)SPI_INT_FEIE;
            break;
        /* SPI/I2S mode error interrupt */
        case SPI_I2S_INT_CONFE:
            SPI_INT(spi_periph) |= (uint32_t)SPI_INT_CONFEIE;
            break;
        /* SPI/I2S TXSER reload interrupt */
        case SPI_I2S_INT_TXSERF:
            SPI_INT(spi_periph) |= (uint32_t)SPI_INT_TXSERFIE;
            break;
        default:
            break;
        }
    }
}

