RT-Thread-Studio/sdk-csp-gd32h7/libraries/GD32H75E_standard_peripheral/Source/gd32h75e_spi.c
/*!
    \brief      disable SPI and I2S interrupt
    \param[in]  spi_periph: SPIx(x=0,1,2,3,4,5)
    \param[in]  interrupt: SPI/I2S interrupt
                only one parameter can be selected which is shown as below:
      \arg        SPI_I2S_INT_RP: RP interrupt
      \arg        SPI_I2S_INT_TP: TP interrupt
      \arg        SPI_I2S_INT_DP: DP interrupt
      \arg        SPI_I2S_INT_ESTC: end of transfer or suspend or TXFIFO clear interrupt
      \arg        SPI_I2S_INT_TXF: transmission filled interrupt
      \arg        SPI_I2S_INT_TXURE: underrun error interrupt
      \arg        SPI_I2S_INT_RXORE: overrun error interrupt
      \arg        SPI_I2S_INT_CRCER: CRC error interrupt
      \arg        SPI_I2S_INT_FE: TI frame error interrupt
      \arg        SPI_I2S_INT_CONFE: mode error interrupt
      \arg        SPI_I2S_INT_TXSERF: TXSER reload interrupt
    \param[out] none
    \retval     none
*/
void spi_i2s_interrupt_disable(uint32_t spi_periph, uint8_t interrupt)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x003BU), ERR_PERIPH);
    } else if(NOT_SPI_I2S_INTERRUPT(interrupt)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x003BU), ERR_PARAM_INVALID);
    } else
#endif
    {
        switch(interrupt) {
        /* SPI/I2S RP interrupt */
        case SPI_I2S_INT_RP:
            SPI_INT(spi_periph) &= (uint32_t)(~SPI_INT_RPIE);
            break;
        /* SPI/I2S TP interrupt */
        case SPI_I2S_INT_TP:
            SPI_INT(spi_periph) &= (uint32_t)(~SPI_INT_TPIE);
            break;
        /* SPI/I2S DP interrupt */
        case SPI_I2S_INT_DP:
            SPI_INT(spi_periph) &= (uint32_t)(~SPI_INT_DPIE);
            break;
        /* SPI/I2S end of transfer or suspend or TXFIFO clear interrupt */
        case SPI_I2S_INT_ESTC:
            SPI_INT(spi_periph) &= (uint32_t)(~SPI_INT_ESTCIE);
            break;
        /* SPI/I2S transmission filled interrupt */
        case SPI_I2S_INT_TXF:
            SPI_INT(spi_periph) &= (uint32_t)(~SPI_INT_TXFIE);
            break;
        /* SPI/I2S underrun error interrupt */
        case SPI_I2S_INT_TXURE:
            SPI_INT(spi_periph) &= (uint32_t)(~SPI_INT_TXUREIE);
            break;
        /* SPI/I2S overrun error interrupt*/
        case SPI_I2S_INT_RXORE:
            SPI_INT(spi_periph) &= (uint32_t)(~SPI_INT_RXOREIE);
            break;
        /* SPI/I2S CRC error interrupt */
        case SPI_I2S_INT_CRCER:
            SPI_INT(spi_periph) &= (uint32_t)(~SPI_INT_CRCERIE);
            break;
        /* SPI TI frame error interrupt */
        case SPI_I2S_INT_FE:
            SPI_INT(spi_periph) &= (uint32_t)(~SPI_INT_FEIE);
            break;
        /* SPI/I2S mode error interrupt */
        case SPI_I2S_INT_CONFE:
            SPI_INT(spi_periph) &= (uint32_t)(~SPI_INT_CONFEIE);
            break;
        /* SPI/I2S TXSER reload interrupt */
        case SPI_I2S_INT_TXSERF:
            SPI_INT(spi_periph) &= (uint32_t)(~SPI_INT_TXSERFIE);
            break;
        default:
            break;
        }
    }
}

/*!
    \brief      get SPI and I2S interrupt flag status
    \param[in]  spi_periph: SPIx(x=0,1,2,3,4,5)
    \param[in]  interrupt: SPI/I2S interrupt flag status
                only one parameter can be selected which is shown as below:
      \arg        SPI_I2S_INT_FLAG_RP: RP interrupt flag
      \arg        SPI_I2S_INT_FLAG_TP: TP interrupt flag
      \arg        SPI_I2S_INT_FLAG_DP: DP interrupt flag
      \arg        SPI_I2S_INT_FLAG_ET: end of transfer or receive interrupt flag
      \arg        SPI_I2S_INT_FLAG_TXF: transmission filled interrupt flag
      \arg        SPI_I2S_INT_FLAG_TXURERR: underrun error interrupt flag
      \arg        SPI_I2S_INT_FLAG_RXORERR: overrun error interrupt flag
      \arg        SPI_I2S_INT_FLAG_CRCERR: CRC error interrupt flag
      \arg        SPI_I2S_INT_FLAG_FERR: TI frame error interrupt flag
      \arg        SPI_I2S_INT_FLAG_CONFERR: mode error interrupt flag
      \arg        SPI_I2S_INT_FLAG_TXSERF: TXSER reload interrupt flag
      \arg        SPI_I2S_INT_FLAG_SPD: suspend interrupt flag
      \arg        SPI_I2S_INT_FLAG_TC: TxFIFO clear interrupt flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus spi_i2s_interrupt_flag_get(uint32_t spi_periph, uint8_t interrupt)
{
    FlagStatus reval = RESET;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x003CU), ERR_PERIPH);
    } else if(NOT_SPI_I2S_INTERRUPT_FLAG_STATUS(interrupt)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x003CU), ERR_PARAM_INVALID);
    } else
#endif
    {
        uint32_t reg1 = SPI_STAT(spi_periph);
        uint32_t reg2 = SPI_INT(spi_periph);

        switch(interrupt) {
        /* SPI/I2S RP interrupt */
        case SPI_I2S_INT_FLAG_RP:
            reg1 = reg1 & SPI_STAT_RP;
            reg2 = reg2 & SPI_INT_RPIE;
            break;
        /* SPI/I2S TP interrupt */
        case SPI_I2S_INT_FLAG_TP:
            reg1 = reg1 & SPI_STAT_TP;
            reg2 = reg2 & SPI_INT_TPIE;
            break;
        /* SPI/I2S DP interrupt */
        case SPI_I2S_INT_FLAG_DP:
            reg1 = reg1 & SPI_STAT_DP;
            reg2 = reg2 & SPI_INT_DPIE;
            break;
        /* SPI end of transfer or receive interrupt */
        case SPI_I2S_INT_FLAG_ET:
            reg1 = reg1 & SPI_STAT_ET;
            reg2 = reg2 & SPI_INT_ESTCIE;
            break;
        /* SPI transmission filled interrupt */
        case SPI_I2S_INT_FLAG_TXF:
            reg1 = reg1 & SPI_STAT_TXF;
            reg2 = reg2 & SPI_INT_TXFIE;
            break;
        /* SPI/I2S underrun error interrupt */
        case SPI_I2S_INT_FLAG_TXURERR:
            reg1 = reg1 & SPI_STAT_TXURERR;
            reg2 = reg2 & SPI_INT_TXUREIE;
            break;
        /* SPI/I2S overrun error interrupt */
        case SPI_I2S_INT_FLAG_RXORERR:
            reg1 = reg1 & SPI_STAT_RXORERR;
            reg2 = reg2 & SPI_INT_RXOREIE;
            break;
        /* SPI/I2S CRC error interrupt */
        case SPI_I2S_INT_FLAG_CRCERR:
            reg1 = reg1 & SPI_STAT_CRCERR;
            reg2 = reg2 & SPI_INT_CRCERIE;
            break;
        /* SPI TI frame error interrupt */
        case SPI_I2S_INT_FLAG_FERR:
            reg1 = reg1 & SPI_STAT_FERR;
            reg2 = reg2 & SPI_INT_FEIE;
            break;
        /* SPI/I2S mode error interrupt */
        case SPI_I2S_INT_FLAG_CONFERR:
            reg1 = reg1 & SPI_STAT_CONFERR;
            reg2 = reg2 & SPI_INT_CONFEIE;
            break;
        /* SPI/I2S TXSER reload interrupt */
        case SPI_I2S_INT_FLAG_TXSERF:
            reg1 = reg1 & SPI_STAT_TXSERF;
            reg2 = reg2 & SPI_INT_TXSERFIE;
            break;
        /* SPI suspend interrupt */
        case SPI_I2S_INT_FLAG_SPD:
            reg1 = reg1 & SPI_STAT_SPD;
            reg2 = reg2 & SPI_INT_ESTCIE;
            break;
        /* SPI TXFIFO clear interrupt */
        case SPI_I2S_INT_FLAG_TC:
            reg1 = reg1 & SPI_STAT_TC;
            reg2 = reg2 & SPI_INT_ESTCIE;
            break;
        default :
            break;
        }
        /*get SPI/I2S interrupt flag status */
        if((0U != reg1) && (0U != reg2)) {
            reval = SET;
        }
    }
    return reval;
}

/*!
    \brief      get SPI and I2S flag status
    \param[in]  spi_periph: SPIx(x=0,1,2,3,4,5)
    \param[in]  flag: SPI/I2S flag status
                only one parameter can be selected which is shown as below:
      \arg        SPI_FLAG_RP: RP flag
      \arg        SPI_FLAG_TP: TP flag
      \arg        SPI_FLAG_DP: DP flag
      \arg        SPI_FLAG_ET: end of transfer or receive flag
      \arg        SPI_FLAG_TXF: transmission filled flag
      \arg        SPI_FLAG_TXURERR: underrun error flag
      \arg        SPI_FLAG_RXORERR: overrun error flag
      \arg        SPI_FLAG_CRCERR: CRC error flag
      \arg        SPI_FLAG_FERR: TI frame error flag
      \arg        SPI_FLAG_CONFERR: mode error flag
      \arg        SPI_FLAG_TXSERF: TXSER reload flag
      \arg        SPI_FLAG_SPD: suspend flag
      \arg        SPI_FLAG_TC: TxFIFO clear flag
      \arg        SPI_FLAG_RWNE: the word of RXFIFO is not empty flag

      \arg        I2S_FLAG_RP: RP flag
      \arg        I2S_FLAG_TP: TP flag
      \arg        I2S_FLAG_DP: DP flag
      \arg        I2S_FLAG_ET: end of transfer or receive flag
      \arg        I2S_FLAG_TXF: transmission filled flag
      \arg        I2S_FLAG_TXURERR: underrun error flag
      \arg        I2S_FLAG_RXORERR: overrun error flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus spi_i2s_flag_get(uint32_t spi_periph, uint32_t flag)
{
    FlagStatus reval = RESET ;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x003DU), ERR_PERIPH);
    } else if(NOT_SPI_I2S_FLAG_STATUS(flag)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x003DU), ERR_PARAM_INVALID);
    } else
#endif
    {
        if(SPI_STAT(spi_periph) & flag) {
            reval = SET;
        } else {
            reval = RESET;
        }
    }
    return reval;
}

/*!
    \brief      clear SPI and I2S flag
    \param[in]  spi_periph: SPIx(x=0,1,2,3,4,5)
    \param[in]  flag: SPI/I2S flag status
                only one parameter can be selected which is shown as below:
      \arg        SPI_STATC_ETC: clear the end of transfer flag
      \arg        SPI_STATC_TXFC: clear the send transmission filled flag
      \arg        SPI_STATC_TXURERRC: clear the transmission underrun error flag
      \arg        SPI_STATC_RXORERRC: clear the reception overrun error flag
      \arg        SPI_STATC_CRCERRC: clear the CRC error flag
      \arg        SPI_STATC_FERRC: clear the SPI TI format error flag
      \arg        SPI_STATC_CONFERRC: clear the configuration error flag
      \arg        SPI_STATC_TXSERFC: clear the TXSERF flag
      \arg        SPI_STATC_SPDC: clear the suspend flag
    \param[out] none
    \retval     none
*/
void spi_i2s_flag_clear(uint32_t spi_periph, uint32_t flag)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x003EU), ERR_PERIPH);
    } else if(NOT_SPI_I2S_CLEAR_FLAG(flag)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x003EU), ERR_PARAM_INVALID);
    } else
#endif
    {
        SPI_STATC(spi_periph) |= (uint32_t)flag;
    }
}

/*!
    \brief      get SPI and I2S RXFIFO packing level
    \param[in]  spi_periph: SPIx(x=0,1,2,3,4,5)
    \param[out] none
    \retval     2-bit RXFIFO packing data frame number
*/
uint32_t spi_i2s_rxfifo_plevel_get(uint32_t spi_periph)
{
    uint32_t reval = 0U ;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x003FU), ERR_PERIPH);
    } else
#endif
    {
        reval = ((uint32_t)((SPI_STAT(spi_periph) & SPI_STAT_RPLVL) >> 13U));
    }
    return reval;
}

/*!
    \brief      get SPI and I2S remaining data frames number in the TXSIZE session
    \param[in]  spi_periph: SPIx(x=0,1,2,3,4,5)
    \param[out] none
    \retval     32-bit value
*/
uint32_t spi_i2s_remain_data_num_get(uint32_t spi_periph)
{
    uint32_t reval = 0U ;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0040U), ERR_PERIPH);
    } else
#endif
    {
        reval = ((uint32_t)((SPI_STAT(spi_periph) & SPI_STAT_CTXSIZE) >> 16U));
    }
    return reval;
}

/*!
    \brief      set SPI FIFO threshold level
    \param[in]  spi_periph: SPIx(x=0,1,2,3,4,5)
    \param[in]  fifo_thl: SPI_FIFO_TH_01DATA, SPI_FIFO_TH_02DATA, SPI_FIFO_TH_03DATA,
                          SPI_FIFO_TH_04DATA, SPI_FIFO_TH_05DATA, SPI_FIFO_TH_06DATA,
                          SPI_FIFO_TH_07DATA, SPI_FIFO_TH_08DATA, SPI_FIFO_TH_09DATA,
                          SPI_FIFO_TH_10DATA, SPI_FIFO_TH_11DATA, SPI_FIFO_TH_12DATA,
                          SPI_FIFO_TH_13DATA, SPI_FIFO_TH_14DATA, SPI_FIFO_TH_15DATA,
                          SPI_FIFO_TH_16DATA
    \param[out] none
    \retval     none
*/
void spi_fifo_threshold_level_set(uint32_t spi_periph, uint32_t fifo_thl)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0041U), ERR_PERIPH);
    } else if(NOT_SPI_I2S_FIFO_LEVEL(fifo_thl)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0041U), ERR_PARAM_INVALID);
    } else
#endif
    {
        SPI_CFG0(spi_periph) &= (uint32_t)(~SPI_CFG0_FIFOLVL);
        SPI_CFG0(spi_periph) |= (uint32_t)fifo_thl;
    }
}

/*!
    \brief      enable SPI word access
    \param[in]  spi_periph: SPIx(x=0,1,2,3,4,5)
    \param[out] none
    \retval     none
*/
void spi_word_access_enable(uint32_t spi_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0040U), ERR_PERIPH);
    } else
#endif
    {
        SPI_CFG0(spi_periph) |= (uint32_t)SPI_CFG0_WORDEN;
    }
}

/*!
    \brief      disable SPI word access
    \param[in]  spi_periph: SPIx(x=0,1,2,3,4,5)
    \param[out] none
    \retval     none
*/
void spi_word_access_disable(uint32_t spi_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0040U), ERR_PERIPH);
    } else
#endif
    {
        SPI_CFG0(spi_periph) &= (uint32_t)(~SPI_CFG0_WORDEN);
    }
}

/*!
    \brief      enable SPI byte access
    \param[in]  spi_periph: SPIx(x=0,1,2,3,4,5)
    \param[out] none
    \retval     none
*/
void spi_byte_access_enable(uint32_t spi_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0040U), ERR_PERIPH);
    } else
#endif
    {
        SPI_CFG0(spi_periph) |= (uint32_t)SPI_CFG0_BYTEN;
    }
}

/*!
    \brief      disable SPI byte access
    \param[in]  spi_periph: SPIx(x=0,1,2,3,4,5)
    \param[out] none
    \retval     none
*/
void spi_byte_access_disable(uint32_t spi_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SPI_PERIPH(spi_periph)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0040U), ERR_PERIPH);
    } else
#endif
    {
        SPI_CFG0(spi_periph) &= (uint32_t)(~SPI_CFG0_BYTEN);
    }
}

